Tests/Functional/Controllers/Frontend/testdata/notify-payload.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<payment xmlns="http://www.elastic-payments.com/schema/payment"
         xmlns:ns2="http://www.elastic-payments.com/schema/epa/transaction">
    <merchant-account-id>53f2895a-e4de-4e82-a813-0d87a10e55e6</merchant-account-id>
    <transaction-id>8ee47139-d547-4619-9d5a-81aa6e2c8f8e</transaction-id>
    <request-id>249XXXXXXXXXxxxXXXXXXXXXxxxXXXXXXXXXxxxXXXXXXXXXXXXXXXXxxxXXXc87</request-id>
    <transaction-type>purchase</transaction-type>
    <transaction-state>success</transaction-state>
    <completion-time-stamp>2018-07-27T08:38:02.000Z</completion-time-stamp>
    <statuses>
        <status code="201.0000" description="3d-acquirer:The resource was successfully created."
                severity="information"/>
    </statuses>
    <requested-amount currency="EUR">70.990000</requested-amount>
    <parent-transaction-id>9c480af8-xxxx-XXXX-xxxx-9124b4204f7e</parent-transaction-id>
    <account-holder>
        <last-name>Lastname</last-name>
        <email>test@example.com</email>
        <phone>05555 / 555555</phone>
        <address>
            <street1>Musterstr. 55</street1>
            <city>Musterhausen</city>
            <country>DE</country>
            <postal-code>55555</postal-code>
        </address>
    </account-holder>
    <shipping>
        <address>
            <street1>Mustermannstraße 92</street1>
            <city>Schöppingen</city>
            <country>DE</country>
            <postal-code>48624</postal-code>
        </address>
    </shipping>
    <card-token>
        <token-id>43XXXXXXXXXXXX03</token-id>
        <masked-account-number>401200******1003</masked-account-number>
    </card-token>
    <ip-address>127.0.0.1</ip-address>
    <order-number>1532501234exxxf</order-number>
    <descriptor></descriptor>
    <notifications format="application/xml">
        <notification
                url="http://localhost/WirecardElasticEnginePayment/notify/method/wirecard_elastic_engine_credit_card"/>
    </notifications>
    <custom-fields>
        <custom-field field-name="paysdk_payment-unique-id" field-value="1532501234exxxf"/>
        <custom-field field-name="elastic-api.merchant-origin" field-value="http://localhost:8000"/>
        <custom-field field-name="elastic-api.ee.original_txn_type" field-value="purchase"/>
    </custom-fields>
    <payment-methods>
        <payment-method name="creditcard"/>
    </payment-methods>
    <parent-transaction-amount currency="EUR">45.940000</parent-transaction-amount>
    <authorization-code>875873</authorization-code>
    <consumer-id>20001</consumer-id>
    <api-id>elastic-api</api-id>
    <locale>de_DE</locale>
    <device>
        <fingerprint>2cfxxxxxxxxxxxxxxxxxxxxxxxxxx37d</fingerprint>
        <policy-score>0</policy-score>
        <type>pc</type>
        <operating-system>linux</operating-system>
    </device>
    <provider-account-id>000000XXXXXXXXX0</provider-account-id>
</payment>